 Veri Seti: https://www.kaggle.com/datasets/denisadutca/bucharest-house-price-dataset

# Kütüphanelerin İçeri Aktarılması

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
from sklearn import linear_model

# Veri Setinin İçeri Aktarılması

In [2]:
df = pd.read_csv("Bucharest_HousePriceDataset.csv")
df.head(10)

   Nr Camere  Suprafata  Etaj  Total Etaje  Sector  Scor    Pret
0          4     108.00     2            3       4     5   83000
1          1      41.00     1            8       1     1   39900
2          3      63.52     1            3       2     3   84900
3          1      33.00     3           10       5     1   45500
4          2      62.00     5            9       5     5   54900
5          3     132.00     2            6       1     2  349990
6          2      49.00     6            6       6     4   36500
7          3      92.00     4            8       2     2  119000
8          3      68.00     3            5       4     5   67500
9          3     110.00     1            2       1     1  133000

# Veri Setinin Anlamlı Hale Getirilmesi

In [7]:
df.rename(columns={'Nr Camere':'Rooms', 'Suprafata':'Surface', 'Etaj':'Floor',
                   'Total Etaje': 'NumberOfFloors', 'Sector':'AreaLocation',
                   'Scor':'Rank', 'Pret':'Price'}, inplace = True)
df.tail()

      Rooms  Surface  Floor  NumberOfFloors  AreaLocation  Rank   Price
3524      3    102.0      2               5             1     1  189000
3525      4     96.0      1               3             3     2  200000
3526      1     35.0      1               3             4     5   47000
3527      2     60.0      6               7             1     2   89500
3528      3     80.0      3               5             1     2  139000

# Parametrelerin ve Fiyatların Farklı Veri Setlerine Ayrılması

In [14]:
parametreler = df[["Rooms","Surface","Floor","NumberOfFloors","AreaLocation","Rank",]]
fiyat = df["Price"]

In [15]:
parametreler.head()

   Rooms  Surface  Floor  NumberOfFloors  AreaLocation  Rank
0      4   108.00      2               3             4     5
1      1    41.00      1               8             1     1
2      3    63.52      1               3             2     3
3      1    33.00      3              10             5     1
4      2    62.00      5               9             5     5

In [17]:
fiyat.head()

0    83000
1    39900
2    84900
3    45500
4    54900
Name: Price, dtype: int64

# Linear Regression Modelinin Uygulanması

In [21]:
#reg.fit işleminde .values olarak almamın sebebi, aksi halde modelin Sütun verilerini de ele alması.
reg = linear_model.LinearRegression()
reg.fit(parametreler.values, fiyat)

LinearRegression()

# Modelin Denenmesi

In [28]:
#Oda, Alan, Kat, Bina Katı, Konutun Alan Konumu, Konum Puanı girilerek tahminler yapılabilir.
reg.predict([[3,68,3,5,4,5],[2,60,6,7,1,2],[4,108,2,3,4,5]])

array([ 66316.96353369, 100997.59893819, 125522.3006186 ])

# Modelin İncelenmesi

In [31]:
#Katsayıların Gösterilmesi
reg.coef_

array([ -1827.35595899,   1579.80857123,   -725.38286958,   1442.51633741,
        -3219.74783714, -11707.87347928])

In [32]:
#Denklem sabitinin gösterilmesi
reg.intercept_

30753.97423374992